API/Flight_WSDL/Report/Res3/Report/Data/Step2.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">GetFlights</td><td class="value col-head-style">StServiceCallActivity4</td><td class="value col-head-style">Done</td><td class="value col-head-style">Web service call performed successfully</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_InputXml_61f74376-3e4b-4f25-891c-a1cf7205fa84.xml\', \'Data/StServiceCallActivity4_InputXml_61f74376-3e4b-4f25-891c-a1cf7205fa84-js4hrpt.js\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;Body&gt;\r\n    &lt;GetFlights xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n      &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n      &lt;FlightDate&gt;2025-12-31T00:00:00+00:00&lt;/FlightDate&gt;\r\n    &lt;/GetFlights&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">Flights_Service</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">FlightsServiceMethods</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">GetFlights</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8000/Flights_SOAP</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_Full_request_b91da92d-b7b6-4090-b33d-57ef48a86d60.xml\', \'Data/StServiceCallActivity4_Full_request_b91da92d-b7b6-4090-b33d-57ef48a86d60-js4hrpt.js\', \'.xml\', \'Full request\');return false;">&lt;?xml version="1.0"? ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8000\nContent-Length:	257\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	3340\nContent-Type:	text/xml; charset=utf-8\nDate:	Mon, 12 May 2025 14:00:32 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:40 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;01:59 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;1492&lt;/FlightNumber&gt;&lt;Price&gt;145.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;06:04 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;04:23 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;1563&lt;/FlightNumber&gt;&lt;Price&gt;141&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;10:52 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;09:11 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;4320&lt;/FlightNumber&gt;&lt;Price&gt;153.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;04:52 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:11 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;4659&lt;/FlightNumber&gt;&lt;Price&gt;128.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;07:16 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;05:35 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;5237&lt;/FlightNumber&gt;&lt;Price&gt;149.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;12:04 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:23 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;5350&lt;/FlightNumber&gt;&lt;Price&gt;133.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;09:40 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;07:59 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;5471&lt;/FlightNumber&gt;&lt;Price&gt;135.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:28 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;06:47 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6118&lt;/FlightNumber&gt;&lt;Price&gt;153&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:00 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6210&lt;/FlightNumber&gt;&lt;Price&gt;171.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:48 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6218&lt;/FlightNumber&gt;&lt;Price&gt;177.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;06:12 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6222&lt;/FlightNumber&gt;&lt;Price&gt;170.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:28 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:47 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;7563&lt;/FlightNumber&gt;&lt;Price&gt;144.6&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:16 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;11:35 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;9891&lt;/FlightNumber&gt;&lt;Price&gt;138.2&lt;/Price&gt;&lt;/Flight&gt;&lt;/GetFlightsResult&gt;&lt;/GetFlightsResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">200 : OK</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_OutputXml_0f39c43d-f85b-4f39-bac5-777cf41801b9.xml\', \'Data/StServiceCallActivity4_OutputXml_0f39c43d-f85b-4f39-bac5-777cf41801b9-js4hrpt.js\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;03:40 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;01:59 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;1492&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;145.8&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;06:04 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;04:23 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;1563&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;141&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;10:52 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;09:11 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;4320&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;153.4&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;04:52 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;03:11 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;4659&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;128.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;07:16 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;05:35 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;5237&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;149.4&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;12:04 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;10:23 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;5350&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;133.4&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;09:40 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;07:59 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;5471&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;135.4&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;08:28 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;06:47 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6118&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;153&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;11:00 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6210&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;171.47&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;03:48 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6218&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;177.47&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;06:12 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6222&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;170.47&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;02:28 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;12:47 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;7563&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;144.6&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;01:16 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;11:35 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;9891&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;138.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n      &lt;/GetFlightsResult&gt;\r\n    &lt;/GetFlightsResponse&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr> </table></div></div>';}